{

    "schedule" : {
        "columns": [
            "c_time",
            "c_columbia_a",
            "c_columbia_b",
            "c_other",
            "c_event"
        ],
        "room": {
            "Columbia A": {
                "name": "Columbia A",
                "location": "Columbia A",
                "column": "c_columbia_a"
            },
            "Columbia B": {
                "name": "Columbia B",
                "location": "Columbia B",
                "column": "c_columbia_b"
            },
            "Other": {
                "name": "Commons & More",
                "location": "Other",
                "column": "c_other"
            },
            "Event": {
                "name": "",
                "location": "",
                "column": "c_event"
            },
            "Conference Room": {
                "name": "Conference Room",
                "location": "Board Room",
                "column": "c_other"
            },
            "Hospitality": {
                "name": "Hospitality",
                "location": "Room 2015",
                "column": "c_other"
            },
            "Commons": {
                "name": "Commons",
                "location": "Summit Ballroom",
                "column": "c_other"
            }

        },
        "class-type": "schedule",
        "day-time-ranges": {
            "Friday": {
                "start-time": "15",
                "stop-time": "21"
            },
            "Saturday": {
                "start-time": "10",
                "stop-time": "21"
            },
            "Sunday": {
                "start-time": "10",
                "stop-time": "15"
            }
        },
        "day-events" :
        {
            "Friday": [
                {
                    "room": "Event",
                    "name": "Registration Opens [Commons]",
                    "hour": "15"

                },
                { "room": "Event", "name": "Art Show, <wbr>Dealer's Room Opens", "hour": "16" },
                { "room": "Event", "name": "Art Show, <wbr>Dealer's Room Closes", "hour": "20" },
                {
                    "room": "Columbia A",
                    "name": "Opening Ceremony & Open Space Generation",
                    "hour": "16",
                    "details": "Open Space Programming<p>Open Space Programming enables the people at the convention to talk about what truly interests them. It encourages participation and communication - and because of that, it’s ideal for a convention like Foolscap. It was developed in 1984 as a way of changing how organizations hold meetings and it’s been used in groups as small as five and as large as 2,100. Our organizers have had experience with groups from 60 to 300, and really like how it works:<p>1. You come to the convention with ideas.<p>2. You come to Columbia A for that day’s hour-long Program Generation Session on Friday at 4 pm and Saturday at 11 am. There the organizers supply forms and pens so you can write down your idea. It can be a topic for round-table discussion, a conversation you want to have with someone else at the convention that you’d like others to watch, a demonstration of something cool you know about, a game you want to play, a problem you want help solving, or any other idea.<p>3. After everyone’s ideas are written down, we read them out. Sometimes ideas are similar and can be combined, with the consent of the proposers.<p>4. Everyone at the session, proposers and audience, is given a strip of five dot stickers. We lay out all the proposals for topics so they’re visible and folks go around and put dots on the items they most want to see happen. If you really want a topic - give it multiple dots!<p>5. We schedule the topics into our Open Space time slots.<p>6. Enjoy yourself! If you’re not enjoying yourself, move to another item and enjoy yourself there.<p>Tom Whitmore, Open Space Coordinator",
                    "excerpt": "Come pitch a panel. It can be a topic for round-table discussion, a conversation you want to have with someone else at the convention that you’d like others to watch, a demonstration of something cool you know about, a game you want to play, a problem you want help solving, or any other idea.<p>Everyone at the session, proposers and audience, is given a strip of five dot stickers. We lay out all the proposals for topics so they’re visible and folks go around and put dots on the items they most want to see happen. If you really want a topic - give it multiple dots! We schedule the topics into our Open Space time slots."
                    
                },
                {
                    "room": "Commons",
                    "class": "planned bottomless",
                    "name": "Bring Your Own Music [Commons]",
                    "details": "BYOM<p>Music, music, music!<p>Friday night we’ll be holding a Foolscap first - the BYOM* dance. Bring CDs or MP3s with songs you want to share, and come hear what everyone else brought. So everyone gets a turn, we prefer songs under 4-5 minutes, but you can bring more than one. Oh, and we’ll provide snacks!<p>*Bring Your Own Music, of course",
                    "hour": "20",
                    "hour-end": "23"
                },
                {
                    "room": "Columbia A", "hour": "17", "class": "openspace",
                    "name": "What Should I Read?",
                    "details": "Tell me what books you've read in the past year that you recommend. Also movies, podcasts, etc. My TBR is hungry!"

                },
                {
                    "class": "openspace",
                    "room": "Columbia B",
                    "hour": "17",
                    "name": "Ask a Black Girl.",
                    "details": "The perennially popular opportunity to ask questions that might be quite awkward as a general rule."
                    
                },
                { "class": "break", "name": "Dinner", "hour": "18", "hour-end": "19" },
                {
                    "class": "openspace",
                    "room": "Columbia B",
                    "hour": "20",
                    "name": "Beyond Disney: Less Well Known Fairy & Folk Tales",
                    "details": "What are you favorite lesser known fairy tales? Do you have opinions about d'Autery vs Peralt vs Anderson?  Come share your favorite stories that people might not know.  <b>R-rated/potentially triggering content.  &emdash; Rebecca"
                },
                {
                    "class": "openspace",
                    "room": "Columbia A",
                    "hour": "20",
                    "name": "Introduce an Adult to SF",
                    "details": "What are good entry books for people who don't read 'genre' books? - Beth"
                }

            ],
            "Saturday": [
                { "room": "Event", "name": "Art Show, <wbr>Dealer's Room Opens", "hour": "10" },
                { "room": "Event", "name": "Art Show, <wbr>Dealer's Room Closes", "hour": "18" },
                { "class": "break", "name": "Lunch", "hour": "12", "hour-end": "13" },
                { "class": "break", "name": "Dinner", "hour": "18", "hour-end": "19" },
                { "room": "Columbia A", "hour": "10", "class": "openspace",
                  "name": "Realistic AI in Fiction",
                  "details": "How to write stories containing artificial intelligence that is realistic based on today's cutting-edge AI research - Dave"
                },
                { "room": "Columbia B", "hour": "10", "class": "openspace",
                  "name": "Urban Fantasy: From Eddie the Fey to October Daye",
                  "details": "Come chat about your favorite urban fantasy classics or show up to tell us about the new classics-to-be that you've discovered.  - Shel"
                },
                { "room": "Columbia A", "hour": "11", "name": "Open Space Generation" },

                { "room": "Columbia A", "hour": "14", "class": "openspace",
                  "name": "Le Guin", "details": "Let's remember her. What was the first book you read or your favorite book. Tell us your memories or conversations with her. Let's talk about the themes in her work. - Beth" },
                { "room": "Hospitality", "hour": "14", "class": "openspace",
                  "name": "Tea Thing", "details": "A taste of 5 true teas and discussion thereof" },                
                { "room": "Columbia B", "hour": "14", "name": "<i>Black Tigers</i>: Sword Demo",
                  "details": "A demonstration of one-on-one rapier techniques."},
                { "room": "Columbia A", "hour": "15", "hour-end":"16", "name": "Conversation with Seanan McGuire" },
                { "room": "Columbia B", "hour": "15", "class": "openspace",
                  "name": "Learn you a Language Good",
                  "details": "Tips and shared experiences in learning a second laungage - Kai"
                },
                { "room": "Columbia B", "hour": "16", "class": "openspace",
                  "name": "Problematic Creators ",
                  "details": "Creaters such as Lovecraft, Marion Zimmer Bradley, Orson Scott Card. How much can we separate the art we like from the artist's behavior and/or beliefs that we reject? Should we even try? Is a canon full of problematic creators a barrier to entry for more diversity in fandom? - Beverly"
                },
                { "room": "Columbia A", "hour": "17", "class": "openspace",
                  "name": "Un-conventional art",
                  "details": "SF/Fantasy art is thriving on the internet and venues other that SF convention art shows. Who are your favorite artists who are working primarily online, at larger comic/media conventions, or other special interest venues? What tresaures have you found while roaming the back aisles of small tables at ComiCon?" },
                { "room": "Columbia B", "hour": "17", "class": "openspace",
                  "name": "Re-Reading",
                  "details": "There is a school of thought that re-reading is a juvenile habit, something children demand as a way to gain comfort. Yet most fans re-read. All critics do. What is it we gain from re-reading, do some texts bear more re-reading than others? And does this notion of comfort reading have any validity?" },

                { "room": "Columbia A", "hour": "13", "name": "Radio Play Auditions" },
                { "room": "Hospitality", "hour": "17", "name": "Radio Play Rehersal [Hospitality]" },
                { "room": "Columbia A", "hour": "20", "name": "Radio Play" },

                { "room": "Columbia B", "hour": "20", "class": "openspace",
                  "name": "'Bitch Fest' - Books We Disliked",
                  "details": "We each get 3 minutes to say what you didn't like about a specific book. Be concise so we all get our turn. - Eileen" },
                { "room": "Columbia A", "hour": "21", "class": "openspace",
                  "name": "3D Printing: Noob Confessions",
                  "details": "I've been 3D printing for 30 days and I have stories. 3D printing can have a steep learning curve. Come and share your experiences. - Lauren" },
                { "room": "Columbia B", "hour": "21", "class": "openspace",
                  "name": "Foolscap Song <strike>Circle</strike> Polygon",
                  "details": " Let's get together, sit in a circle and share songs. Sing-alongs? Things with rousing choruses? Something you literally just wrote? Obscure folk songs?" },

                { "room": "Commons", "hour": "22", "class": "openspace",
                  "name": " Action Castle -- In the spirit of Zork",
                  "details": "by Live Parsley. A Text adventure in the spirit of Zork. Doug will be the computer. - Doug"
                { "room": "Conference Room", "hour": "10", "hour-end":"12", "name": "Writer’s Workshops: “Them’s Fighting Words” (writing fight scenes) with Mark Teppo. [Conference Room]" },
                { "class": "planned bottomless", "room": "Conference Room", "hour": "19.5", "hour-end":"21.5", "name": "Writer’s Workshops: “Writing Sex Scenes with a Purpose” with Sienna Saint Cyr. [Conference Room]" }
            ],
            "Sunday": [
                { "class": "break", "name": "Lunch", "hour": "12", "hour-end": "12.5"},
                { "room": "Commons", "name": "Bite of Foolscap [Commons]", "hour": "12", "hour-end": 12.5,
                  "details": "We are continuing our tradition of a brunch-style banquet for our Sunday mornings: the Bite of Foolscap! Come join us for conversation and good food. Here’s the complete menu: Fresh Chilled Orange & Cranberry Juice; Scrambled Egg Station with Toppings: Bacon Bits, Sour Cream, Green Onions, Shredded Cheddar Cheese, Salsa; Sliced Seasonal Fresh Fruit; Applewood Bacon; A Variety of Pastries, “Crescents”, Doughnuts, and Apple Fritters; Cinnamon French Toast; an Oatmeal Station, Served with Dried Cranberries, Golden Raisins, Brown Sugar & Milk; Taraza Bold Blend Coffee and Tazo Tea" },
                { "room": "Commons", "name": "Foolscap Auction [Commons]", "hour": "13.5" },
                { "room": "Event", "name": "Art Show, <wbr>Dealer's Room Opens", "hour": "10" },
                { "room": "Event", "name": "Art Show Closes", "hour": "12" },
                { "room": "Event", "name": "Dealer's Room Closes", "hour": "15" },
                { "room": "Commons", "hour": "10", "class": "openspace",
                  "name":"Crafting Fun Times",
                  "details":"Let's sit in the same space and make some stuff. Maybe talk about making stuff too? I figured we'd be doing this in the commons but it'd be cool to have a specific time -Wing"
                },
                { "room": "Columbia A", "hour": "10", "class": "openspace",
                  "name":"Romance Novels for geeky people",
                  "details":"Romane novels are experiencing a revolution, currently. There are also many cross overs with SF, Fantasy, urban fantasy, historical eras, and modern geek culture. Ask for recommendations or bring suggestions -Rebecca Newman"},
                { "room": "Columbia B", "hour": "10", "class": "openspace",
                  "name":"E-Books and Dead Trees",
                  "details":"Discuss the pros and cons of ebooks and paper books."
                },
                { "room": "Columbia A", "hour": "11", "class": "openspace",
                  "name":"Why Decide?",
                  "details":"30+ topics in 50 minutes. Bring all ideas (I will steal from Foolscap) and I'll set a timer. Lets see how many we get through. -Beth"
                },
                { "room": "Columbia B", "hour": "11", "class": "openspace",
                  "name":"Fountain Pens - Tools from a more civilized age",
                  "details":"Show off your pens!Learn about pens! Discuss the best paper for pens! -Shel"
                },
                { "room": "Columbia A", "hour": "15", "name": "Deconstructing Foolscap" }
            ]
        }

    }
}
